Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass
Enumerated type listing options for construction class for HVAC analysis.
Since:
2011

Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass.NoneConstruction
A none construction has an infiltration level of 0 cfm/sqft

Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass.TightConstruction
A tight construction has an infiltration level of approximately 0.019 cfm/sqft

Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass.MediumConstruction
A medium construction has an infiltration level of approximately 0.038 cfm/sqft

Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass.LooseConstruction
A loose construction has an infiltration level of approximately 0.076 cfm/sqft